<?php

// Даны три числа. Вывести их на экран по возрастанию.

function task8(): void
{
    $a = 4;
    $b = 5;
    $c = 7;

    // abc
    // bac
    // acb
    // cab
    // cba
    // bca

//    if (($a <= $b) && ($a <= $c) && ($b <= $c)) {
//        echo $a .' ' . $b . ' ' . $c;
//    } elseif (($a <= $b) && ($a <= $c) && ($b <= $c)) {
//
//    }

//    if ($a <= $b && $a <= $c) {
//        if ($b <= $c) {
//            echo $a .' ' . $b . ' ' . $c;
//        } else {
//            echo $a .' ' . $c . ' ' . $b;
//        }
//    } elseif ($b <= $a && $b <= $c) {
//        if ($a <= $c) {
//            echo $b .' ' . $a . ' ' . $c;
//        } else {
//            echo $b .' ' . $c . ' ' . $a;
//        }
//    }
}

function getMonthDayCount(int $month): int
{
    if ($month == 2) {
        return 28;
    }

    if ($month == 1 || $month == 3 || $month == 5) {
        return 31;
    }

    return 30;
}

function task9(): void
{
    // Даны две даты одного года.
    // Каждая - как два числа: день, месяц.
    // Причем месяцы или одинаковые, или соседние.
    // Найдите, на сколько дней даты отличаются.
    // Считать, что в феврале 28 дней.
    // Пример: day1 = 10, month1 = 2; day2 = 15, month2 = 2; ответ: 5.
    // Пример: day1 = 10, month1 = 2; day2 = 15, month2 = 3; ответ: 33

    $day1 = 15;
    $month1 = 6; // 30
    $day2 = 17;
    $month2 = 7;
    // 30 - 15 + 17

    $count = 0;
    if ($month1 == $month2) {
        if ($day1 > $day2) {
            $count = $day1 - $day2;
        } else {
            $count = $day2 - $day1;
        }
    } elseif ($month1 == $month2 - 1) {
        $count = getMonthDayCount($month1) - $day1 + $day2;
    } elseif ($month1 == $month2 + 1) {
        $count = getMonthDayCount($month2) - $day2 + $day1;
    } else {
        $count = -1;
    }
}

function task10(): void
{
    // Робот может перемещаться в четырех направлениях
    // («11» — север, «12» — запад, «13» — юг, «14» — восток)
    // и принимать три цифровые команды:
    // 0 — продолжать движение,
    // 1 — поворот налево,
    // –1 — поворот направо.
    // Дан число (11, 12, 13 или 14)
    // — исходное направление робота и
    // целое число N (0, 1 или -1) —
    // посланная ему команда.
    // Вывести направление робота
    // после выполнения полученной команды
    // (то есть север, запад, юг или восток).
    //

    $start = 12;
    $next = 1;

    if ($start == 11) {
        if ($next == 0) {
            echo '... ';
        }
    }
}

// ЦИКЛЫ

function t1(): void
{
    // Вывести на экран 10 раз слово Hello

//    $count = getMonthDayCount(6);
//
//    for ($i = 1; $i <= $count; $i++) // $i, $j, $k;  $i++
//    {
//        echo $i .' ';
//    }

    // числа 10, 11, 12, 13, 14, ... , 99
//    for ($i = 10; $i < 100; $i++) // $i, $j, $k;  $i++
//    {
//        echo $i . ' ';
//    }

    // числа 10, 12, 14, 16, , 98
//    for ($i = 10; $i < 100; $i += 2) // $i, $j, $k;  $i++; $i = $i + 2
//    {
//        echo $i . ' ';
//    }

//    for ($i = 10; $i < 100; $i++) // $i, $j, $k;  $i++; $i = $i + 2
//    {
//        if ($i % 2 == 0) {
//            echo $i . ' ';
//        }
//    }

    // 10.1, 10.2, 10.3, ..., 10.9

//    for ($i = 10.1; $i <= 10.9; $i += 0.1) {
//        echo $i . ' ';
//    }

    // 1 0 0 0 2 0 0 0 3 0 0 0 4 0 0 0 ... 40 0 0 0

//    for ($i = 1; $i <= 40; $i++) {
//        echo $i . ' 0 0 0 ';
//    }

    // 1 0 2 0 0 3 0 0 0 4 0 0 0 0 ... 40 0 0 0 0 0 0 0 0 0 ... 0

//    for ($i = 1; $i <= 40; $i++) {
//        echo $i . ' ';
//        for ($j = 0; $j < $i; $j++) {
//            echo '0 ';
//        }
//    }

    // *
    // **
    // ***
    // ****
    // *****
    // ******
    // ******* (10)

    for ($i = 0; $i < 10; $i++) {
        for ($j = 0; $j <= $i; $j++) {
            echo '*';
        }
        echo '<br>';
    }

    echo '!';
}

t1();
